var industryData=[
    {
        "name": "销售|客服|市场",
        "code": 1,
        "sub": [
            {
                "name": "销售业务",
                "code": 2,
                "sub": [
                    {
                        "name": "销售代表",
                        "code": 3,
                        "sub": []
                    },
                    {
                        "name": "客户代表",
                        "code": 4,
                        "sub": []
                    },
                    {
                        "name": "销售工程师",
                        "code": 5,
                        "sub": []
                    },
                    {
                        "name": "渠道/分销专员",
                        "code": 6,
                        "sub": []
                    },
                    {
                        "name": "区域销售专员/助理",
                        "code": 7,
                        "sub": []
                    },
                    {
                        "name": "业务拓展专员/助理",
                        "code": 8,
                        "sub": []
                    },
                    {
                        "name": "大客户销售代表",
                        "code": 9,
                        "sub": []
                    },
                    {
                        "name": "电话销售",
                        "code": 10,
                        "sub": []
                    },
                    {
                        "name": "网络/在线销售",
                        "code": 11,
                        "sub": []
                    },
                    {
                        "name": "团购业务员",
                        "code": 12,
                        "sub": []
                    },
                    {
                        "name": "销售业务跟单",
                        "code": 13,
                        "sub": []
                    },
                    {
                        "name": "医药代表",
                        "code": 14,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 15,
                        "sub": []
                    }
                ]
            },
            {
                "name": "销售管理",
                "code": 16,
                "sub": [
                    {
                        "name": "销售总监",
                        "code": 17,
                        "sub": []
                    },
                    {
                        "name": "销售经理",
                        "code": 18,
                        "sub": []
                    },
                    {
                        "name": "销售主管",
                        "code": 19,
                        "sub": []
                    },
                    {
                        "name": "客户总监",
                        "code": 20,
                        "sub": []
                    },
                    {
                        "name": "客户经理",
                        "code": 21,
                        "sub": []
                    },
                    {
                        "name": "客户主管",
                        "code": 22,
                        "sub": []
                    },
                    {
                        "name": "渠道/分销总监",
                        "code": 23,
                        "sub": []
                    },
                    {
                        "name": "渠道/分销经理/主管",
                        "code": 24,
                        "sub": []
                    },
                    {
                        "name": "区域销售总监",
                        "code": 25,
                        "sub": []
                    },
                    {
                        "name": "区域销售经理/主管",
                        "code": 26,
                        "sub": []
                    },
                    {
                        "name": "业务拓展经理/主管",
                        "code": 27,
                        "sub": []
                    },
                    {
                        "name": "大客户销售经理",
                        "code": 28,
                        "sub": []
                    },
                    {
                        "name": "团购经理/主管",
                        "code": 29,
                        "sub": []
                    },
                    {
                        "name": "医药销售经理/主管",
                        "code": 30,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 31,
                        "sub": []
                    }
                ]
            },
            {
                "name": "销售行政/商务",
                "code": 32,
                "sub": [
                    {
                        "name": "销售行政经理/主管",
                        "code": 33,
                        "sub": []
                    },
                    {
                        "name": "销售行政专员/助理",
                        "code": 34,
                        "sub": []
                    },
                    {
                        "name": "销售运营经理/主管",
                        "code": 35,
                        "sub": []
                    },
                    {
                        "name": "销售运营专员/助理",
                        "code": 36,
                        "sub": []
                    },
                    {
                        "name": "商务经理/主管",
                        "code": 37,
                        "sub": []
                    },
                    {
                        "name": "商务专员/助理",
                        "code": 38,
                        "sub": []
                    },
                    {
                        "name": "销售培训师/讲师",
                        "code": 39,
                        "sub": []
                    },
                    {
                        "name": "销售数据分析",
                        "code": 40,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 41,
                        "sub": []
                    }
                ]
            },
            {
                "name": "客服/售前/售后技术支持",
                "code": 42,
                "sub": [
                    {
                        "name": "客户服务总监",
                        "code": 43,
                        "sub": []
                    },
                    {
                        "name": "客户服务经理",
                        "code": 44,
                        "sub": []
                    },
                    {
                        "name": "客户服务主管",
                        "code": 45,
                        "sub": []
                    },
                    {
                        "name": "客户服务专员/助理",
                        "code": 46,
                        "sub": []
                    },
                    {
                        "name": "客户关系/投诉协调人员",
                        "code": 47,
                        "sub": []
                    },
                    {
                        "name": "客户咨询热线/呼叫中心人员",
                        "code": 48,
                        "sub": []
                    },
                    {
                        "name": "网络/在线客服",
                        "code": 49,
                        "sub": []
                    },
                    {
                        "name": "售前/售后技术支持管理",
                        "code": 50,
                        "sub": []
                    },
                    {
                        "name": "售前/售后技术支持工程师",
                        "code": 51,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 52,
                        "sub": []
                    }
                ]
            },
            {
                "name": "市场",
                "code": 53,
                "sub": [
                    {
                        "name": "市场总监",
                        "code": 54,
                        "sub": []
                    },
                    {
                        "name": "市场经理",
                        "code": 55,
                        "sub": []
                    },
                    {
                        "name": "市场主管",
                        "code": 56,
                        "sub": []
                    },
                    {
                        "name": "市场专员/助理",
                        "code": 57,
                        "sub": []
                    },
                    {
                        "name": "市场营销经理",
                        "code": 58,
                        "sub": []
                    },
                    {
                        "name": "市场营销主管",
                        "code": 59,
                        "sub": []
                    },
                    {
                        "name": "市场营销专员/助理",
                        "code": 60,
                        "sub": []
                    },
                    {
                        "name": "业务拓展经理/主管",
                        "code": 61,
                        "sub": []
                    },
                    {
                        "name": "业务拓展专员/助理",
                        "code": 62,
                        "sub": []
                    },
                    {
                        "name": "产品经理",
                        "code": 63,
                        "sub": []
                    },
                    {
                        "name": "产品主管",
                        "code": 64,
                        "sub": []
                    },
                    {
                        "name": "产品专员/助理",
                        "code": 65,
                        "sub": []
                    },
                    {
                        "name": "品牌经理",
                        "code": 66,
                        "sub": []
                    },
                    {
                        "name": "品牌主管",
                        "code": 67,
                        "sub": []
                    },
                    {
                        "name": "品牌专员/助理",
                        "code": 68,
                        "sub": []
                    },
                    {
                        "name": "市场策划/企划经理/主管",
                        "code": 69,
                        "sub": []
                    },
                    {
                        "name": "市场策划/企划专员/助理",
                        "code": 70,
                        "sub": []
                    },
                    {
                        "name": "市场文案策划",
                        "code": 71,
                        "sub": []
                    },
                    {
                        "name": "活动策划",
                        "code": 72,
                        "sub": []
                    },
                    {
                        "name": "活动执行",
                        "code": 73,
                        "sub": []
                    },
                    {
                        "name": "促销主管/督导",
                        "code": 74,
                        "sub": []
                    },
                    {
                        "name": "促销员",
                        "code": 75,
                        "sub": []
                    },
                    {
                        "name": "网站推广",
                        "code": 76,
                        "sub": []
                    },
                    {
                        "name": "SEO/SEM",
                        "code": 77,
                        "sub": []
                    },
                    {
                        "name": "学术推广",
                        "code": 78,
                        "sub": []
                    },
                    {
                        "name": "选址拓展/新店开发",
                        "code": 79,
                        "sub": []
                    },
                    {
                        "name": "市场调研与分析",
                        "code": 80,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 81,
                        "sub": []
                    }
                ]
            },
            {
                "name": "公关/媒介",
                "code": 82,
                "sub": [
                    {
                        "name": "公关总监",
                        "code": 83,
                        "sub": []
                    },
                    {
                        "name": "公关经理/主管",
                        "code": 84,
                        "sub": []
                    },
                    {
                        "name": "公关专员/助理",
                        "code": 85,
                        "sub": []
                    },
                    {
                        "name": "媒介经理/主管",
                        "code": 86,
                        "sub": []
                    },
                    {
                        "name": "媒介专员/助理",
                        "code": 87,
                        "sub": []
                    },
                    {
                        "name": "媒介策划/管理",
                        "code": 88,
                        "sub": []
                    },
                    {
                        "name": "政府事务管理",
                        "code": 89,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 90,
                        "sub": []
                    }
                ]
            },
            {
                "name": "广告/会展",
                "code": 91,
                "sub": [
                    {
                        "name": "广告创意/设计总监",
                        "code": 92,
                        "sub": []
                    },
                    {
                        "name": "广告创意/设计经理/主管",
                        "code": 93,
                        "sub": []
                    },
                    {
                        "name": "广告创意/设计师",
                        "code": 94,
                        "sub": []
                    },
                    {
                        "name": "广告文案策划",
                        "code": 95,
                        "sub": []
                    },
                    {
                        "name": "广告美术指导",
                        "code": 96,
                        "sub": []
                    },
                    {
                        "name": "广告制作执行",
                        "code": 97,
                        "sub": []
                    },
                    {
                        "name": "广告客户总监",
                        "code": 98,
                        "sub": []
                    },
                    {
                        "name": "广告客户经理",
                        "code": 99,
                        "sub": []
                    },
                    {
                        "name": "广告客户主管",
                        "code": 100,
                        "sub": []
                    },
                    {
                        "name": "广告客户代表",
                        "code": 101,
                        "sub": []
                    },
                    {
                        "name": "广告/会展业务拓展",
                        "code": 102,
                        "sub": []
                    },
                    {
                        "name": "会展策划/设计",
                        "code": 103,
                        "sub": []
                    },
                    {
                        "name": "会务经理/主管",
                        "code": 104,
                        "sub": []
                    },
                    {
                        "name": "会务专员/助理",
                        "code": 105,
                        "sub": []
                    },
                    {
                        "name": "广告/会展项目管理",
                        "code": 106,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 107,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "财务|人力资源|行政",
        "code": 108,
        "sub": [
            {
                "name": "财务/审计/税务",
                "code": 109,
                "sub": [
                    {
                        "name": "首席财务官CFO",
                        "code": 110,
                        "sub": []
                    },
                    {
                        "name": "财务总监",
                        "code": 111,
                        "sub": []
                    },
                    {
                        "name": "财务经理",
                        "code": 112,
                        "sub": []
                    },
                    {
                        "name": "财务主管/总帐主管",
                        "code": 113,
                        "sub": []
                    },
                    {
                        "name": "财务顾问",
                        "code": 114,
                        "sub": []
                    },
                    {
                        "name": "财务助理",
                        "code": 115,
                        "sub": []
                    },
                    {
                        "name": "财务分析经理/主管",
                        "code": 116,
                        "sub": []
                    },
                    {
                        "name": "财务分析员",
                        "code": 117,
                        "sub": []
                    },
                    {
                        "name": "会计经理/主管",
                        "code": 118,
                        "sub": []
                    },
                    {
                        "name": "会计/会计师",
                        "code": 119,
                        "sub": []
                    },
                    {
                        "name": "会计助理/文员",
                        "code": 120,
                        "sub": []
                    },
                    {
                        "name": "出纳员",
                        "code": 121,
                        "sub": []
                    },
                    {
                        "name": "审计经理/主管",
                        "code": 122,
                        "sub": []
                    },
                    {
                        "name": "审计专员/助理",
                        "code": 123,
                        "sub": []
                    },
                    {
                        "name": "税务经理/主管",
                        "code": 124,
                        "sub": []
                    },
                    {
                        "name": "税务专员/助理",
                        "code": 125,
                        "sub": []
                    },
                    {
                        "name": "成本经理/主管",
                        "code": 126,
                        "sub": []
                    },
                    {
                        "name": "成本会计",
                        "code": 127,
                        "sub": []
                    },
                    {
                        "name": "资产/资金管理",
                        "code": 128,
                        "sub": []
                    },
                    {
                        "name": "资金专员",
                        "code": 129,
                        "sub": []
                    },
                    {
                        "name": "统计员",
                        "code": 130,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 131,
                        "sub": []
                    }
                ]
            },
            {
                "name": "人力资源",
                "code": 132,
                "sub": [
                    {
                        "name": "人力资源总监",
                        "code": 133,
                        "sub": []
                    },
                    {
                        "name": "人力资源经理",
                        "code": 134,
                        "sub": []
                    },
                    {
                        "name": "人力资源主管",
                        "code": 135,
                        "sub": []
                    },
                    {
                        "name": "人力资源专员/助理",
                        "code": 136,
                        "sub": []
                    },
                    {
                        "name": "培训经理/主管",
                        "code": 137,
                        "sub": []
                    },
                    {
                        "name": "培训专员/助理",
                        "code": 138,
                        "sub": []
                    },
                    {
                        "name": "招聘经理/主管",
                        "code": 139,
                        "sub": []
                    },
                    {
                        "name": "招聘专员/助理",
                        "code": 140,
                        "sub": []
                    },
                    {
                        "name": "薪酬福利经理/主管",
                        "code": 141,
                        "sub": []
                    },
                    {
                        "name": "薪酬福利专员/助理",
                        "code": 142,
                        "sub": []
                    },
                    {
                        "name": "绩效考核经理/主管",
                        "code": 143,
                        "sub": []
                    },
                    {
                        "name": "绩效考核专员/助理",
                        "code": 144,
                        "sub": []
                    },
                    {
                        "name": "员工关系/企业文化/工会",
                        "code": 145,
                        "sub": []
                    },
                    {
                        "name": "企业培训师/讲师",
                        "code": 146,
                        "sub": []
                    },
                    {
                        "name": "人事信息系统(HRIS)管理",
                        "code": 147,
                        "sub": []
                    },
                    {
                        "name": "猎头顾问/助理",
                        "code": 148,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 149,
                        "sub": []
                    }
                ]
            },
            {
                "name": "行政/后勤/文秘",
                "code": 150,
                "sub": [
                    {
                        "name": "行政总监",
                        "code": 151,
                        "sub": []
                    },
                    {
                        "name": "行政经理/主管/办公室主任",
                        "code": 152,
                        "sub": []
                    },
                    {
                        "name": "行政专员/助理",
                        "code": 153,
                        "sub": []
                    },
                    {
                        "name": "助理/秘书/文员",
                        "code": 154,
                        "sub": []
                    },
                    {
                        "name": "前台/总机/接待",
                        "code": 155,
                        "sub": []
                    },
                    {
                        "name": "文档/资料管理",
                        "code": 156,
                        "sub": []
                    },
                    {
                        "name": "电脑操作/打字/录入员",
                        "code": 157,
                        "sub": []
                    },
                    {
                        "name": "后勤人员",
                        "code": 158,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 159,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "项目|质量|高级管理",
        "code": 160,
        "sub": [
            {
                "name": "项目管理/项目协调",
                "code": 161,
                "sub": [
                    {
                        "name": "项目总监",
                        "code": 162,
                        "sub": []
                    },
                    {
                        "name": "项目经理/项目主管",
                        "code": 163,
                        "sub": []
                    },
                    {
                        "name": "项目专员/助理",
                        "code": 164,
                        "sub": []
                    },
                    {
                        "name": "广告/会展项目管理",
                        "code": 165,
                        "sub": []
                    },
                    {
                        "name": "IT项目总监",
                        "code": 166,
                        "sub": []
                    },
                    {
                        "name": "IT项目经理/主管",
                        "code": 167,
                        "sub": []
                    },
                    {
                        "name": "IT项目执行/协调人员",
                        "code": 168,
                        "sub": []
                    },
                    {
                        "name": "通信项目管理",
                        "code": 169,
                        "sub": []
                    },
                    {
                        "name": "房地产项目配套工程师",
                        "code": 170,
                        "sub": []
                    },
                    {
                        "name": "房地产项目管理",
                        "code": 171,
                        "sub": []
                    },
                    {
                        "name": "证券/投资项目管理",
                        "code": 172,
                        "sub": []
                    },
                    {
                        "name": "保险项目经理/主管",
                        "code": 173,
                        "sub": []
                    },
                    {
                        "name": "生产项目经理/主管",
                        "code": 174,
                        "sub": []
                    },
                    {
                        "name": "生产项目工程师",
                        "code": 175,
                        "sub": []
                    },
                    {
                        "name": "汽车工程项目管理",
                        "code": 176,
                        "sub": []
                    },
                    {
                        "name": "电子/电器项目管理",
                        "code": 177,
                        "sub": []
                    },
                    {
                        "name": "服装/纺织/皮革项目管理",
                        "code": 178,
                        "sub": []
                    },
                    {
                        "name": "医药项目管理",
                        "code": 179,
                        "sub": []
                    },
                    {
                        "name": "化工项目管理",
                        "code": 180,
                        "sub": []
                    },
                    {
                        "name": "物流/仓储项目管理",
                        "code": 181,
                        "sub": []
                    },
                    {
                        "name": "咨询项目管理",
                        "code": 182,
                        "sub": []
                    },
                    {
                        "name": "能源/矿产项目管理",
                        "code": 183,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 184,
                        "sub": []
                    }
                ]
            },
            {
                "name": "质量管理/安全防护",
                "code": 185,
                "sub": [
                    {
                        "name": "质量管理/测试经理",
                        "code": 186,
                        "sub": []
                    },
                    {
                        "name": "质量管理/测试主管",
                        "code": 187,
                        "sub": []
                    },
                    {
                        "name": "质量管理/测试工程师",
                        "code": 188,
                        "sub": []
                    },
                    {
                        "name": "质量检验员/测试员",
                        "code": 189,
                        "sub": []
                    },
                    {
                        "name": "化验/检验",
                        "code": 190,
                        "sub": []
                    },
                    {
                        "name": "认证/体系工程师/审核员",
                        "code": 191,
                        "sub": []
                    },
                    {
                        "name": "环境/健康/安全经理/主管",
                        "code": 192,
                        "sub": []
                    },
                    {
                        "name": "环境/健康/安全工程师",
                        "code": 193,
                        "sub": []
                    },
                    {
                        "name": "供应商/采购质量管理",
                        "code": 194,
                        "sub": []
                    },
                    {
                        "name": "安全管理",
                        "code": 195,
                        "sub": []
                    },
                    {
                        "name": "安全消防",
                        "code": 196,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 197,
                        "sub": []
                    }
                ]
            },
            {
                "name": "高级管理",
                "code": 198,
                "sub": [
                    {
                        "name": "首席执行官CEO/总裁/总经理",
                        "code": 199,
                        "sub": []
                    },
                    {
                        "name": "首席运营官COO",
                        "code": 200,
                        "sub": []
                    },
                    {
                        "name": "首席财务官CFO",
                        "code": 201,
                        "sub": []
                    },
                    {
                        "name": "CTO/CIO",
                        "code": 202,
                        "sub": []
                    },
                    {
                        "name": "副总裁/副总经理",
                        "code": 203,
                        "sub": []
                    },
                    {
                        "name": "分公司/代表处负责人",
                        "code": 204,
                        "sub": []
                    },
                    {
                        "name": "部门/事业部管理",
                        "code": 205,
                        "sub": []
                    },
                    {
                        "name": "总裁助理/总经理助理",
                        "code": 206,
                        "sub": []
                    },
                    {
                        "name": "总编/副总编",
                        "code": 207,
                        "sub": []
                    },
                    {
                        "name": "行长/副行长",
                        "code": 208,
                        "sub": []
                    },
                    {
                        "name": "工厂厂长/副厂长",
                        "code": 209,
                        "sub": []
                    },
                    {
                        "name": "校长/副校长",
                        "code": 210,
                        "sub": []
                    },
                    {
                        "name": "合伙人",
                        "code": 211,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 212,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "IT|互联网|通信",
        "code": 213,
        "sub": [
            {
                "name": "软件/互联网开发/系统集成",
                "code": 214,
                "sub": [
                    {
                        "name": "高级软件工程师",
                        "code": 215,
                        "sub": []
                    },
                    {
                        "name": "软件工程师",
                        "code": 216,
                        "sub": []
                    },
                    {
                        "name": "软件研发工程师",
                        "code": 217,
                        "sub": []
                    },
                    {
                        "name": "需求工程师",
                        "code": 218,
                        "sub": []
                    },
                    {
                        "name": "系统架构设计师",
                        "code": 219,
                        "sub": []
                    },
                    {
                        "name": "系统分析员",
                        "code": 220,
                        "sub": []
                    },
                    {
                        "name": "数据库开发工程师",
                        "code": 221,
                        "sub": []
                    },
                    {
                        "name": "ERP技术/开发应用",
                        "code": 222,
                        "sub": []
                    },
                    {
                        "name": "互联网软件工程师",
                        "code": 223,
                        "sub": []
                    },
                    {
                        "name": "手机软件开发工程师",
                        "code": 224,
                        "sub": []
                    },
                    {
                        "name": "嵌入式软件开发",
                        "code": 225,
                        "sub": []
                    },
                    {
                        "name": "移动互联网开发",
                        "code": 226,
                        "sub": []
                    },
                    {
                        "name": "WEB前端开发",
                        "code": 227,
                        "sub": []
                    },
                    {
                        "name": "语音/视频/图形开发",
                        "code": 228,
                        "sub": []
                    },
                    {
                        "name": "用户界面（UI）设计",
                        "code": 229,
                        "sub": []
                    },
                    {
                        "name": "用户体验（UE/UX）设计",
                        "code": 230,
                        "sub": []
                    },
                    {
                        "name": "网页设计/制作/美工",
                        "code": 231,
                        "sub": []
                    },
                    {
                        "name": "游戏设计/开发",
                        "code": 232,
                        "sub": []
                    },
                    {
                        "name": "游戏策划",
                        "code": 233,
                        "sub": []
                    },
                    {
                        "name": "游戏界面设计",
                        "code": 234,
                        "sub": []
                    },
                    {
                        "name": "系统集成工程师",
                        "code": 235,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 236,
                        "sub": []
                    }
                ]
            },
            {
                "name": "硬件开发",
                "code": 237,
                "sub": [
                    {
                        "name": "高级硬件工程师",
                        "code": 238,
                        "sub": []
                    },
                    {
                        "name": "硬件工程师",
                        "code": 239,
                        "sub": []
                    },
                    {
                        "name": "嵌入式硬件开发",
                        "code": 240,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 241,
                        "sub": []
                    }
                ]
            },
            {
                "name": "互联网产品/运营管理",
                "code": 242,
                "sub": [
                    {
                        "name": "互联网产品经理/主管",
                        "code": 243,
                        "sub": []
                    },
                    {
                        "name": "互联网产品专员/助理",
                        "code": 244,
                        "sub": []
                    },
                    {
                        "name": "电子商务经理/主管",
                        "code": 245,
                        "sub": []
                    },
                    {
                        "name": "电子商务专员/助理",
                        "code": 246,
                        "sub": []
                    },
                    {
                        "name": "网络运营管理",
                        "code": 247,
                        "sub": []
                    },
                    {
                        "name": "网络运营专员/助理",
                        "code": 248,
                        "sub": []
                    },
                    {
                        "name": "网站编辑",
                        "code": 249,
                        "sub": []
                    },
                    {
                        "name": "SEO/SEM",
                        "code": 250,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 251,
                        "sub": []
                    }
                ]
            },
            {
                "name": "IT质量管理/测试/配置管理",
                "code": 252,
                "sub": [
                    {
                        "name": "IT质量管理经理/主管",
                        "code": 253,
                        "sub": []
                    },
                    {
                        "name": "IT质量管理工程师",
                        "code": 254,
                        "sub": []
                    },
                    {
                        "name": "系统测试",
                        "code": 255,
                        "sub": []
                    },
                    {
                        "name": "软件测试",
                        "code": 256,
                        "sub": []
                    },
                    {
                        "name": "硬件测试",
                        "code": 257,
                        "sub": []
                    },
                    {
                        "name": "配置管理工程师",
                        "code": 258,
                        "sub": []
                    },
                    {
                        "name": "信息技术标准化工程师",
                        "code": 259,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 260,
                        "sub": []
                    }
                ]
            },
            {
                "name": "IT运维/技术支持",
                "code": 261,
                "sub": [
                    {
                        "name": "信息技术经理/主管",
                        "code": 262,
                        "sub": []
                    },
                    {
                        "name": "信息技术专员",
                        "code": 263,
                        "sub": []
                    },
                    {
                        "name": "IT技术支持/维护经理",
                        "code": 264,
                        "sub": []
                    },
                    {
                        "name": "IT技术支持/维护工程师",
                        "code": 265,
                        "sub": []
                    },
                    {
                        "name": "系统工程师",
                        "code": 266,
                        "sub": []
                    },
                    {
                        "name": "系统管理员",
                        "code": 267,
                        "sub": []
                    },
                    {
                        "name": "网络工程师",
                        "code": 268,
                        "sub": []
                    },
                    {
                        "name": "网络管理员",
                        "code": 269,
                        "sub": []
                    },
                    {
                        "name": "网络与信息安全工程师",
                        "code": 270,
                        "sub": []
                    },
                    {
                        "name": "数据库管理员",
                        "code": 271,
                        "sub": []
                    },
                    {
                        "name": "计算机硬件维护工程师",
                        "code": 272,
                        "sub": []
                    },
                    {
                        "name": "ERP实施顾问",
                        "code": 273,
                        "sub": []
                    },
                    {
                        "name": "IT技术文员/助理",
                        "code": 274,
                        "sub": []
                    },
                    {
                        "name": "IT文档工程师",
                        "code": 275,
                        "sub": []
                    },
                    {
                        "name": "Helpdesk",
                        "code": 276,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 277,
                        "sub": []
                    }
                ]
            },
            {
                "name": "IT管理/项目协调",
                "code": 278,
                "sub": [
                    {
                        "name": "CTO/CIO",
                        "code": 279,
                        "sub": []
                    },
                    {
                        "name": "IT技术/研发总监",
                        "code": 280,
                        "sub": []
                    },
                    {
                        "name": "IT技术/研发经理/主管",
                        "code": 281,
                        "sub": []
                    },
                    {
                        "name": "IT项目总监",
                        "code": 282,
                        "sub": []
                    },
                    {
                        "name": "IT项目经理/主管",
                        "code": 283,
                        "sub": []
                    },
                    {
                        "name": "IT项目执行/协调人员",
                        "code": 284,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 285,
                        "sub": []
                    }
                ]
            },
            {
                "name": "电信/通信技术开发及应用",
                "code": 286,
                "sub": [
                    {
                        "name": "通信技术工程师",
                        "code": 287,
                        "sub": []
                    },
                    {
                        "name": "通信研发工程师",
                        "code": 288,
                        "sub": []
                    },
                    {
                        "name": "数据通信工程师",
                        "code": 289,
                        "sub": []
                    },
                    {
                        "name": "移动通信工程师",
                        "code": 290,
                        "sub": []
                    },
                    {
                        "name": "电信网络工程师",
                        "code": 291,
                        "sub": []
                    },
                    {
                        "name": "电信交换工程师",
                        "code": 292,
                        "sub": []
                    },
                    {
                        "name": "有线传输工程师",
                        "code": 293,
                        "sub": []
                    },
                    {
                        "name": "无线/射频通信工程师",
                        "code": 294,
                        "sub": []
                    },
                    {
                        "name": "通信电源工程师",
                        "code": 295,
                        "sub": []
                    },
                    {
                        "name": "通信标准化工程师",
                        "code": 296,
                        "sub": []
                    },
                    {
                        "name": "通信项目管理",
                        "code": 297,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 298,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "房产|建筑|物业管理",
        "code": 299,
        "sub": [
            {
                "name": "房地产开发/经纪/中介",
                "code": 300,
                "sub": [
                    {
                        "name": "房地产项目策划经理/主管",
                        "code": 301,
                        "sub": []
                    },
                    {
                        "name": "房地产项目策划专员/助理",
                        "code": 302,
                        "sub": []
                    },
                    {
                        "name": "房地产项目招投标",
                        "code": 303,
                        "sub": []
                    },
                    {
                        "name": "房地产项目开发报建",
                        "code": 304,
                        "sub": []
                    },
                    {
                        "name": "房地产项目配套工程师",
                        "code": 305,
                        "sub": []
                    },
                    {
                        "name": "房地产销售经理",
                        "code": 306,
                        "sub": []
                    },
                    {
                        "name": "房地产销售主管",
                        "code": 307,
                        "sub": []
                    },
                    {
                        "name": "房地产销售/置业顾问",
                        "code": 308,
                        "sub": []
                    },
                    {
                        "name": "房地产评估",
                        "code": 309,
                        "sub": []
                    },
                    {
                        "name": "房地产中介/交易",
                        "code": 310,
                        "sub": []
                    },
                    {
                        "name": "房地产项目管理",
                        "code": 311,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 312,
                        "sub": []
                    }
                ]
            },
            {
                "name": "土木/建筑/装修/市政工程",
                "code": 313,
                "sub": [
                    {
                        "name": "高级建筑工程师/总工",
                        "code": 314,
                        "sub": []
                    },
                    {
                        "name": "建筑工程师",
                        "code": 315,
                        "sub": []
                    },
                    {
                        "name": "建筑设计师",
                        "code": 316,
                        "sub": []
                    },
                    {
                        "name": "土木/土建/结构工程师",
                        "code": 317,
                        "sub": []
                    },
                    {
                        "name": "岩土工程",
                        "code": 318,
                        "sub": []
                    },
                    {
                        "name": "建筑制图",
                        "code": 319,
                        "sub": []
                    },
                    {
                        "name": "建筑工程测绘/测量",
                        "code": 320,
                        "sub": []
                    },
                    {
                        "name": "道路/桥梁/隧道工程技术",
                        "code": 321,
                        "sub": []
                    },
                    {
                        "name": "水利/港口工程技术",
                        "code": 322,
                        "sub": []
                    },
                    {
                        "name": "架线和管道工程技术",
                        "code": 323,
                        "sub": []
                    },
                    {
                        "name": "给排水/暖通/空调工程",
                        "code": 324,
                        "sub": []
                    },
                    {
                        "name": "智能大厦/布线/弱电/安防",
                        "code": 325,
                        "sub": []
                    },
                    {
                        "name": "室内装潢设计",
                        "code": 326,
                        "sub": []
                    },
                    {
                        "name": "幕墙工程师",
                        "code": 327,
                        "sub": []
                    },
                    {
                        "name": "园林/景观设计",
                        "code": 328,
                        "sub": []
                    },
                    {
                        "name": "城市规划与设计",
                        "code": 329,
                        "sub": []
                    },
                    {
                        "name": "市政工程师",
                        "code": 330,
                        "sub": []
                    },
                    {
                        "name": "工程监理/质量管理",
                        "code": 331,
                        "sub": []
                    },
                    {
                        "name": "工程造价/预结算",
                        "code": 332,
                        "sub": []
                    },
                    {
                        "name": "工程资料管理",
                        "code": 333,
                        "sub": []
                    },
                    {
                        "name": "建筑施工现场管理",
                        "code": 334,
                        "sub": []
                    },
                    {
                        "name": "施工队长",
                        "code": 335,
                        "sub": []
                    },
                    {
                        "name": "施工员",
                        "code": 336,
                        "sub": []
                    },
                    {
                        "name": "建筑工程安全管理",
                        "code": 337,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 338,
                        "sub": []
                    }
                ]
            },
            {
                "name": "物业管理",
                "code": 339,
                "sub": [
                    {
                        "name": "物业经理/主管",
                        "code": 340,
                        "sub": []
                    },
                    {
                        "name": "物业管理专员/助理",
                        "code": 341,
                        "sub": []
                    },
                    {
                        "name": "物业租赁/销售",
                        "code": 342,
                        "sub": []
                    },
                    {
                        "name": "物业维修",
                        "code": 343,
                        "sub": []
                    },
                    {
                        "name": "物业顾问",
                        "code": 344,
                        "sub": []
                    },
                    {
                        "name": "物业招商管理",
                        "code": 345,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 346,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "金融",
        "code": 347,
        "sub": [
            {
                "name": "银行",
                "code": 348,
                "sub": [
                    {
                        "name": "行长/副行长",
                        "code": 349,
                        "sub": []
                    },
                    {
                        "name": "银行经理/主任",
                        "code": 350,
                        "sub": []
                    },
                    {
                        "name": "银行大堂经理",
                        "code": 351,
                        "sub": []
                    },
                    {
                        "name": "银行客户总监",
                        "code": 352,
                        "sub": []
                    },
                    {
                        "name": "银行客户经理",
                        "code": 353,
                        "sub": []
                    },
                    {
                        "name": "银行客户主管",
                        "code": 354,
                        "sub": []
                    },
                    {
                        "name": "银行客户代表",
                        "code": 355,
                        "sub": []
                    },
                    {
                        "name": "银行客户服务",
                        "code": 356,
                        "sub": []
                    },
                    {
                        "name": "综合业务经理/主管",
                        "code": 357,
                        "sub": []
                    },
                    {
                        "name": "综合业务专员/助理",
                        "code": 358,
                        "sub": []
                    },
                    {
                        "name": "银行会计/柜员",
                        "code": 359,
                        "sub": []
                    },
                    {
                        "name": "公司业务",
                        "code": 360,
                        "sub": []
                    },
                    {
                        "name": "个人业务",
                        "code": 361,
                        "sub": []
                    },
                    {
                        "name": "银行卡/电子银行业务推广",
                        "code": 362,
                        "sub": []
                    },
                    {
                        "name": "信贷管理/资信评估/分析",
                        "code": 363,
                        "sub": []
                    },
                    {
                        "name": "信审核查",
                        "code": 364,
                        "sub": []
                    },
                    {
                        "name": "外汇交易",
                        "code": 365,
                        "sub": []
                    },
                    {
                        "name": "进出口/信用证结算",
                        "code": 366,
                        "sub": []
                    },
                    {
                        "name": "清算人员",
                        "code": 367,
                        "sub": []
                    },
                    {
                        "name": "风险控制",
                        "code": 368,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 369,
                        "sub": []
                    }
                ]
            },
            {
                "name": "证券/期货/投资管理/服务",
                "code": 370,
                "sub": [
                    {
                        "name": "证券总监/部门经理",
                        "code": 371,
                        "sub": []
                    },
                    {
                        "name": "证券/期货/外汇经纪人",
                        "code": 372,
                        "sub": []
                    },
                    {
                        "name": "证券/投资客户总监",
                        "code": 373,
                        "sub": []
                    },
                    {
                        "name": "证券/投资客户经理",
                        "code": 374,
                        "sub": []
                    },
                    {
                        "name": "证券/投资客户主管",
                        "code": 375,
                        "sub": []
                    },
                    {
                        "name": "证券/投资客户代表",
                        "code": 376,
                        "sub": []
                    },
                    {
                        "name": "证券分析/金融研究",
                        "code": 377,
                        "sub": []
                    },
                    {
                        "name": "投资/理财服务",
                        "code": 378,
                        "sub": []
                    },
                    {
                        "name": "投资银行业务",
                        "code": 379,
                        "sub": []
                    },
                    {
                        "name": "融资总监",
                        "code": 380,
                        "sub": []
                    },
                    {
                        "name": "融资经理/主管",
                        "code": 381,
                        "sub": []
                    },
                    {
                        "name": "融资专员/助理",
                        "code": 382,
                        "sub": []
                    },
                    {
                        "name": "股票/期货操盘手",
                        "code": 383,
                        "sub": []
                    },
                    {
                        "name": "资产评估",
                        "code": 384,
                        "sub": []
                    },
                    {
                        "name": "风险管理/控制/稽查",
                        "code": 385,
                        "sub": []
                    },
                    {
                        "name": "储备经理人",
                        "code": 386,
                        "sub": []
                    },
                    {
                        "name": "证券/投资项目管理",
                        "code": 387,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 388,
                        "sub": []
                    }
                ]
            },
            {
                "name": "保险",
                "code": 389,
                "sub": [
                    {
                        "name": "保险业务管理",
                        "code": 390,
                        "sub": []
                    },
                    {
                        "name": "保险代理/经纪人/客户经理",
                        "code": 391,
                        "sub": []
                    },
                    {
                        "name": "保险顾问/财务规划师",
                        "code": 392,
                        "sub": []
                    },
                    {
                        "name": "保险产品开发/项目策划",
                        "code": 393,
                        "sub": []
                    },
                    {
                        "name": "保险培训师",
                        "code": 394,
                        "sub": []
                    },
                    {
                        "name": "保险契约管理",
                        "code": 395,
                        "sub": []
                    },
                    {
                        "name": "核保理赔",
                        "code": 396,
                        "sub": []
                    },
                    {
                        "name": "汽车定损/车险理赔",
                        "code": 397,
                        "sub": []
                    },
                    {
                        "name": "保险精算师",
                        "code": 398,
                        "sub": []
                    },
                    {
                        "name": "客户服务/续期管理",
                        "code": 399,
                        "sub": []
                    },
                    {
                        "name": "保险内勤",
                        "code": 400,
                        "sub": []
                    },
                    {
                        "name": "保险项目经理/主管",
                        "code": 401,
                        "sub": []
                    },
                    {
                        "name": "储备经理人",
                        "code": 402,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 403,
                        "sub": []
                    }
                ]
            },
            {
                "name": "信托/担保/拍卖/典当",
                "code": 404,
                "sub": [
                    {
                        "name": "信托服务",
                        "code": 405,
                        "sub": []
                    },
                    {
                        "name": "担保业务",
                        "code": 406,
                        "sub": []
                    },
                    {
                        "name": "拍卖师",
                        "code": 407,
                        "sub": []
                    },
                    {
                        "name": "典当业务",
                        "code": 408,
                        "sub": []
                    },
                    {
                        "name": "珠宝/收藏品鉴定",
                        "code": 409,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 410,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "采购|贸易|交通|物流",
        "code": 411,
        "sub": [
            {
                "name": "采购/贸易",
                "code": 412,
                "sub": [
                    {
                        "name": "采购总监",
                        "code": 413,
                        "sub": []
                    },
                    {
                        "name": "采购经理/主管",
                        "code": 414,
                        "sub": []
                    },
                    {
                        "name": "采购专员/助理",
                        "code": 415,
                        "sub": []
                    },
                    {
                        "name": "供应商开发",
                        "code": 416,
                        "sub": []
                    },
                    {
                        "name": "供应链管理",
                        "code": 417,
                        "sub": []
                    },
                    {
                        "name": "买手",
                        "code": 418,
                        "sub": []
                    },
                    {
                        "name": "外贸/贸易经理/主管",
                        "code": 419,
                        "sub": []
                    },
                    {
                        "name": "外贸/贸易专员/助理",
                        "code": 420,
                        "sub": []
                    },
                    {
                        "name": "贸易跟单",
                        "code": 421,
                        "sub": []
                    },
                    {
                        "name": "报关员",
                        "code": 422,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 423,
                        "sub": []
                    }
                ]
            },
            {
                "name": "交通运输服务",
                "code": 424,
                "sub": [
                    {
                        "name": "机动车司机/驾驶",
                        "code": 425,
                        "sub": []
                    },
                    {
                        "name": "列车驾驶/操作",
                        "code": 426,
                        "sub": []
                    },
                    {
                        "name": "船舶驾驶/操作",
                        "code": 427,
                        "sub": []
                    },
                    {
                        "name": "飞机驾驶/操作",
                        "code": 428,
                        "sub": []
                    },
                    {
                        "name": "公交/地铁乘务",
                        "code": 429,
                        "sub": []
                    },
                    {
                        "name": "列车乘务",
                        "code": 430,
                        "sub": []
                    },
                    {
                        "name": "船舶乘务",
                        "code": 431,
                        "sub": []
                    },
                    {
                        "name": "船员/水手",
                        "code": 432,
                        "sub": []
                    },
                    {
                        "name": "航空乘务",
                        "code": 433,
                        "sub": []
                    },
                    {
                        "name": "地勤人员",
                        "code": 434,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 435,
                        "sub": []
                    }
                ]
            },
            {
                "name": "物流/仓储",
                "code": 436,
                "sub": [
                    {
                        "name": "物流总监",
                        "code": 437,
                        "sub": []
                    },
                    {
                        "name": "物流经理/主管",
                        "code": 438,
                        "sub": []
                    },
                    {
                        "name": "物流专员/助理",
                        "code": 439,
                        "sub": []
                    },
                    {
                        "name": "货运代理",
                        "code": 440,
                        "sub": []
                    },
                    {
                        "name": "运输经理/主管",
                        "code": 441,
                        "sub": []
                    },
                    {
                        "name": "快递员/速递员",
                        "code": 442,
                        "sub": []
                    },
                    {
                        "name": "水运/空运/陆运操作",
                        "code": 443,
                        "sub": []
                    },
                    {
                        "name": "集装箱业务",
                        "code": 444,
                        "sub": []
                    },
                    {
                        "name": "报关员",
                        "code": 445,
                        "sub": []
                    },
                    {
                        "name": "单证员",
                        "code": 446,
                        "sub": []
                    },
                    {
                        "name": "仓库经理/主管",
                        "code": 447,
                        "sub": []
                    },
                    {
                        "name": "仓库/物料管理员",
                        "code": 448,
                        "sub": []
                    },
                    {
                        "name": "理货/分拣/打包",
                        "code": 449,
                        "sub": []
                    },
                    {
                        "name": "物流/仓储调度",
                        "code": 450,
                        "sub": []
                    },
                    {
                        "name": "物流/仓储项目管理",
                        "code": 451,
                        "sub": []
                    },
                    {
                        "name": "搬运工",
                        "code": 452,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 453,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "生产|制造",
        "code": 454,
        "sub": [
            {
                "name": "生产管理/运营",
                "code": 455,
                "sub": [
                    {
                        "name": "工厂厂长/副厂长",
                        "code": 456,
                        "sub": []
                    },
                    {
                        "name": "生产总监",
                        "code": 457,
                        "sub": []
                    },
                    {
                        "name": "生产经理/车间主任",
                        "code": 458,
                        "sub": []
                    },
                    {
                        "name": "生产主管/督导/组长",
                        "code": 459,
                        "sub": []
                    },
                    {
                        "name": "生产运营管理",
                        "code": 460,
                        "sub": []
                    },
                    {
                        "name": "生产项目经理/主管",
                        "code": 461,
                        "sub": []
                    },
                    {
                        "name": "生产项目工程师",
                        "code": 462,
                        "sub": []
                    },
                    {
                        "name": "产品管理",
                        "code": 463,
                        "sub": []
                    },
                    {
                        "name": "生产计划",
                        "code": 464,
                        "sub": []
                    },
                    {
                        "name": "制造工程师",
                        "code": 465,
                        "sub": []
                    },
                    {
                        "name": "工艺/制程工程师",
                        "code": 466,
                        "sub": []
                    },
                    {
                        "name": "工业工程师",
                        "code": 467,
                        "sub": []
                    },
                    {
                        "name": "生产设备管理",
                        "code": 468,
                        "sub": []
                    },
                    {
                        "name": "生产物料管理（PMC）",
                        "code": 469,
                        "sub": []
                    },
                    {
                        "name": "包装工程师",
                        "code": 470,
                        "sub": []
                    },
                    {
                        "name": "技术文档工程师",
                        "code": 471,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 472,
                        "sub": []
                    }
                ]
            },
            {
                "name": "电子/电器/半导体/仪器仪表",
                "code": 473,
                "sub": [
                    {
                        "name": "电子技术研发工程师",
                        "code": 474,
                        "sub": []
                    },
                    {
                        "name": "电子/电器工程师",
                        "code": 475,
                        "sub": []
                    },
                    {
                        "name": "电器研发工程师",
                        "code": 476,
                        "sub": []
                    },
                    {
                        "name": "电子/电器工艺/制程工程师",
                        "code": 477,
                        "sub": []
                    },
                    {
                        "name": "电路工程师/技术员",
                        "code": 478,
                        "sub": []
                    },
                    {
                        "name": "模拟电路设计/应用工程师",
                        "code": 479,
                        "sub": []
                    },
                    {
                        "name": "版图设计工程师",
                        "code": 480,
                        "sub": []
                    },
                    {
                        "name": "集成电路IC设计/应用工程师",
                        "code": 481,
                        "sub": []
                    },
                    {
                        "name": "IC验证工程师",
                        "code": 482,
                        "sub": []
                    },
                    {
                        "name": "电子元器件工程师",
                        "code": 483,
                        "sub": []
                    },
                    {
                        "name": "射频工程师",
                        "code": 484,
                        "sub": []
                    },
                    {
                        "name": "无线电工程师",
                        "code": 485,
                        "sub": []
                    },
                    {
                        "name": "激光/光电子技术",
                        "code": 486,
                        "sub": []
                    },
                    {
                        "name": "光源/照明工程师",
                        "code": 487,
                        "sub": []
                    },
                    {
                        "name": "变压器与磁电工程师",
                        "code": 488,
                        "sub": []
                    },
                    {
                        "name": "电池/电源开发",
                        "code": 489,
                        "sub": []
                    },
                    {
                        "name": "家用电器/数码产品研发",
                        "code": 490,
                        "sub": []
                    },
                    {
                        "name": "空调工程/设计",
                        "code": 491,
                        "sub": []
                    },
                    {
                        "name": "音频/视频工程师/技术员",
                        "code": 492,
                        "sub": []
                    },
                    {
                        "name": "安防系统工程师",
                        "code": 493,
                        "sub": []
                    },
                    {
                        "name": "电子/电器设备工程师",
                        "code": 494,
                        "sub": []
                    },
                    {
                        "name": "电子/电器维修/保养",
                        "code": 495,
                        "sub": []
                    },
                    {
                        "name": "电子/电器项目管理",
                        "code": 496,
                        "sub": []
                    },
                    {
                        "name": "电气工程师",
                        "code": 497,
                        "sub": []
                    },
                    {
                        "name": "电气设计",
                        "code": 498,
                        "sub": []
                    },
                    {
                        "name": "电气线路设计",
                        "code": 499,
                        "sub": []
                    },
                    {
                        "name": "线路结构设计",
                        "code": 500,
                        "sub": []
                    },
                    {
                        "name": "半导体技术",
                        "code": 501,
                        "sub": []
                    },
                    {
                        "name": "仪器/仪表/计量工程师",
                        "code": 502,
                        "sub": []
                    },
                    {
                        "name": "自动化工程师",
                        "code": 503,
                        "sub": []
                    },
                    {
                        "name": "现场应用工程师（FAE）",
                        "code": 504,
                        "sub": []
                    },
                    {
                        "name": "测试/可靠性工程师",
                        "code": 505,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 506,
                        "sub": []
                    }
                ]
            },
            {
                "name": "汽车制造",
                "code": 507,
                "sub": [
                    {
                        "name": "汽车动力系统工程师",
                        "code": 508,
                        "sub": []
                    },
                    {
                        "name": "汽车底盘/总装工程师",
                        "code": 509,
                        "sub": []
                    },
                    {
                        "name": "车身设计工程师",
                        "code": 510,
                        "sub": []
                    },
                    {
                        "name": "汽车电子工程师",
                        "code": 511,
                        "sub": []
                    },
                    {
                        "name": "汽车机械工程师",
                        "code": 512,
                        "sub": []
                    },
                    {
                        "name": "汽车零部件设计师",
                        "code": 513,
                        "sub": []
                    },
                    {
                        "name": "汽车装配工艺工程师",
                        "code": 514,
                        "sub": []
                    },
                    {
                        "name": "安全性能工程师",
                        "code": 515,
                        "sub": []
                    },
                    {
                        "name": "汽车工程项目管理",
                        "code": 516,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 517,
                        "sub": []
                    }
                ]
            },
            {
                "name": "汽车销售与服务",
                "code": 518,
                "sub": [
                    {
                        "name": "汽车销售",
                        "code": 519,
                        "sub": []
                    },
                    {
                        "name": "汽车零配件销售",
                        "code": 520,
                        "sub": []
                    },
                    {
                        "name": "汽车售后服务/客户服务",
                        "code": 521,
                        "sub": []
                    },
                    {
                        "name": "汽车维修/保养",
                        "code": 522,
                        "sub": []
                    },
                    {
                        "name": "汽车质量管理/检验检测",
                        "code": 523,
                        "sub": []
                    },
                    {
                        "name": "汽车定损/车险理赔",
                        "code": 524,
                        "sub": []
                    },
                    {
                        "name": "汽车装饰美容",
                        "code": 525,
                        "sub": []
                    },
                    {
                        "name": "二手车评估师",
                        "code": 526,
                        "sub": []
                    },
                    {
                        "name": "4S店管理",
                        "code": 527,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 528,
                        "sub": []
                    }
                ]
            },
            {
                "name": "机械设计/制造/维修",
                "code": 529,
                "sub": [
                    {
                        "name": "工程机械经理",
                        "code": 530,
                        "sub": []
                    },
                    {
                        "name": "工程机械主管",
                        "code": 531,
                        "sub": []
                    },
                    {
                        "name": "机械设备经理",
                        "code": 532,
                        "sub": []
                    },
                    {
                        "name": "机械设备工程师",
                        "code": 533,
                        "sub": []
                    },
                    {
                        "name": "机械工程师",
                        "code": 534,
                        "sub": []
                    },
                    {
                        "name": "机械设计师",
                        "code": 535,
                        "sub": []
                    },
                    {
                        "name": "机械制图员",
                        "code": 536,
                        "sub": []
                    },
                    {
                        "name": "机械研发工程师",
                        "code": 537,
                        "sub": []
                    },
                    {
                        "name": "机械结构工程师",
                        "code": 538,
                        "sub": []
                    },
                    {
                        "name": "机械工艺/制程工程师",
                        "code": 539,
                        "sub": []
                    },
                    {
                        "name": "气动工程师",
                        "code": 540,
                        "sub": []
                    },
                    {
                        "name": "CNC/数控工程师",
                        "code": 541,
                        "sub": []
                    },
                    {
                        "name": "模具工程师",
                        "code": 542,
                        "sub": []
                    },
                    {
                        "name": "夹具工程师",
                        "code": 543,
                        "sub": []
                    },
                    {
                        "name": "注塑工程师",
                        "code": 544,
                        "sub": []
                    },
                    {
                        "name": "铸造/锻造工程师/技师",
                        "code": 545,
                        "sub": []
                    },
                    {
                        "name": "机电工程师",
                        "code": 546,
                        "sub": []
                    },
                    {
                        "name": "材料工程师",
                        "code": 547,
                        "sub": []
                    },
                    {
                        "name": "机械维修/保养",
                        "code": 548,
                        "sub": []
                    },
                    {
                        "name": "飞机设计与制造",
                        "code": 549,
                        "sub": []
                    },
                    {
                        "name": "飞机维修/保养",
                        "code": 550,
                        "sub": []
                    },
                    {
                        "name": "列车设计与制造",
                        "code": 551,
                        "sub": []
                    },
                    {
                        "name": "列车维修/保养",
                        "code": 552,
                        "sub": []
                    },
                    {
                        "name": "船舶设计与制造",
                        "code": 553,
                        "sub": []
                    },
                    {
                        "name": "船舶维修/保养",
                        "code": 554,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 555,
                        "sub": []
                    }
                ]
            },
            {
                "name": "服装/纺织/皮革设计/生产",
                "code": 556,
                "sub": [
                    {
                        "name": "服装/纺织品设计",
                        "code": 557,
                        "sub": []
                    },
                    {
                        "name": "服装打样/制版",
                        "code": 558,
                        "sub": []
                    },
                    {
                        "name": "服装/纺织/皮革工艺师",
                        "code": 559,
                        "sub": []
                    },
                    {
                        "name": "电脑放码员",
                        "code": 560,
                        "sub": []
                    },
                    {
                        "name": "裁床",
                        "code": 561,
                        "sub": []
                    },
                    {
                        "name": "样衣工",
                        "code": 562,
                        "sub": []
                    },
                    {
                        "name": "面料辅料开发/采购",
                        "code": 563,
                        "sub": []
                    },
                    {
                        "name": "服装/纺织/皮革跟单",
                        "code": 564,
                        "sub": []
                    },
                    {
                        "name": "服装/纺织品/皮革销售",
                        "code": 565,
                        "sub": []
                    },
                    {
                        "name": "服装/纺织品/皮革质量管理",
                        "code": 566,
                        "sub": []
                    },
                    {
                        "name": "服装/纺织/皮革项目管理",
                        "code": 567,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 568,
                        "sub": []
                    }
                ]
            },
            {
                "name": "技工/操作工",
                "code": 569,
                "sub": [
                    {
                        "name": "车床/磨床/铣床/冲床工",
                        "code": 570,
                        "sub": []
                    },
                    {
                        "name": "模具工",
                        "code": 571,
                        "sub": []
                    },
                    {
                        "name": "钳工/机修工/钣金工",
                        "code": 572,
                        "sub": []
                    },
                    {
                        "name": "电焊工/铆焊工",
                        "code": 573,
                        "sub": []
                    },
                    {
                        "name": "电工",
                        "code": 574,
                        "sub": []
                    },
                    {
                        "name": "水工/木工/油漆工",
                        "code": 575,
                        "sub": []
                    },
                    {
                        "name": "铲车/叉车工",
                        "code": 576,
                        "sub": []
                    },
                    {
                        "name": "空调工/电梯工/锅炉工",
                        "code": 577,
                        "sub": []
                    },
                    {
                        "name": "汽车维修/保养",
                        "code": 578,
                        "sub": []
                    },
                    {
                        "name": "普工/操作工",
                        "code": 579,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 580,
                        "sub": []
                    }
                ]
            },
            {
                "name": "生物/制药/医疗器械",
                "code": 581,
                "sub": [
                    {
                        "name": "医药代表",
                        "code": 582,
                        "sub": []
                    },
                    {
                        "name": "医药销售经理/主管",
                        "code": 583,
                        "sub": []
                    },
                    {
                        "name": "药品市场推广经理/主管",
                        "code": 584,
                        "sub": []
                    },
                    {
                        "name": "药品市场推广专员/助理",
                        "code": 585,
                        "sub": []
                    },
                    {
                        "name": "医疗器械销售",
                        "code": 586,
                        "sub": []
                    },
                    {
                        "name": "医疗器械推广",
                        "code": 587,
                        "sub": []
                    },
                    {
                        "name": "医药学术推广",
                        "code": 588,
                        "sub": []
                    },
                    {
                        "name": "医药招商",
                        "code": 589,
                        "sub": []
                    },
                    {
                        "name": "医药项目管理",
                        "code": 590,
                        "sub": []
                    },
                    {
                        "name": "医药项目招投标管理",
                        "code": 591,
                        "sub": []
                    },
                    {
                        "name": "生物工程/生物制药",
                        "code": 592,
                        "sub": []
                    },
                    {
                        "name": "药品研发",
                        "code": 593,
                        "sub": []
                    },
                    {
                        "name": "医疗器械研发",
                        "code": 594,
                        "sub": []
                    },
                    {
                        "name": "临床研究员",
                        "code": 595,
                        "sub": []
                    },
                    {
                        "name": "临床协调员",
                        "code": 596,
                        "sub": []
                    },
                    {
                        "name": "临床数据分析员",
                        "code": 597,
                        "sub": []
                    },
                    {
                        "name": "医药化学分析",
                        "code": 598,
                        "sub": []
                    },
                    {
                        "name": "医药技术研发管理人员",
                        "code": 599,
                        "sub": []
                    },
                    {
                        "name": "药品注册",
                        "code": 600,
                        "sub": []
                    },
                    {
                        "name": "医疗器械注册",
                        "code": 601,
                        "sub": []
                    },
                    {
                        "name": "药品生产/质量管理",
                        "code": 602,
                        "sub": []
                    },
                    {
                        "name": "医疗器械生产/质量管理",
                        "code": 603,
                        "sub": []
                    },
                    {
                        "name": "医疗器械维修/保养",
                        "code": 604,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 605,
                        "sub": []
                    }
                ]
            },
            {
                "name": "化工",
                "code": 606,
                "sub": [
                    {
                        "name": "化工工程师",
                        "code": 607,
                        "sub": []
                    },
                    {
                        "name": "化工研发工程师",
                        "code": 608,
                        "sub": []
                    },
                    {
                        "name": "化学分析",
                        "code": 609,
                        "sub": []
                    },
                    {
                        "name": "化学技术应用",
                        "code": 610,
                        "sub": []
                    },
                    {
                        "name": "化学操作",
                        "code": 611,
                        "sub": []
                    },
                    {
                        "name": "化学制剂研发",
                        "code": 612,
                        "sub": []
                    },
                    {
                        "name": "油漆/化工涂料研发",
                        "code": 613,
                        "sub": []
                    },
                    {
                        "name": "塑料工程师",
                        "code": 614,
                        "sub": []
                    },
                    {
                        "name": "化学实验室技术员/研究员",
                        "code": 615,
                        "sub": []
                    },
                    {
                        "name": "化工项目管理",
                        "code": 616,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 617,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "传媒|印刷|艺术|设计",
        "code": 618,
        "sub": [
            {
                "name": "影视/媒体/出版/印刷",
                "code": 619,
                "sub": [
                    {
                        "name": "导演/编导",
                        "code": 620,
                        "sub": []
                    },
                    {
                        "name": "总编/副总编",
                        "code": 621,
                        "sub": []
                    },
                    {
                        "name": "艺术指导/舞美设计",
                        "code": 622,
                        "sub": []
                    },
                    {
                        "name": "摄影师/摄像师",
                        "code": 623,
                        "sub": []
                    },
                    {
                        "name": "化妆师/造型师/服装/道具",
                        "code": 624,
                        "sub": []
                    },
                    {
                        "name": "主持人/司仪",
                        "code": 625,
                        "sub": []
                    },
                    {
                        "name": "演员/模特",
                        "code": 626,
                        "sub": []
                    },
                    {
                        "name": "配音员",
                        "code": 627,
                        "sub": []
                    },
                    {
                        "name": "音效师",
                        "code": 628,
                        "sub": []
                    },
                    {
                        "name": "后期制作",
                        "code": 629,
                        "sub": []
                    },
                    {
                        "name": "经纪人/星探",
                        "code": 630,
                        "sub": []
                    },
                    {
                        "name": "放映管理",
                        "code": 631,
                        "sub": []
                    },
                    {
                        "name": "作家/编剧/撰稿人",
                        "code": 632,
                        "sub": []
                    },
                    {
                        "name": "文字编辑/组稿",
                        "code": 633,
                        "sub": []
                    },
                    {
                        "name": "美术编辑/美术设计",
                        "code": 634,
                        "sub": []
                    },
                    {
                        "name": "记者/采编",
                        "code": 635,
                        "sub": []
                    },
                    {
                        "name": "电话采编",
                        "code": 636,
                        "sub": []
                    },
                    {
                        "name": "文案策划",
                        "code": 637,
                        "sub": []
                    },
                    {
                        "name": "校对/录入",
                        "code": 638,
                        "sub": []
                    },
                    {
                        "name": "发行管理",
                        "code": 639,
                        "sub": []
                    },
                    {
                        "name": "排版设计",
                        "code": 640,
                        "sub": []
                    },
                    {
                        "name": "印刷排版/制版",
                        "code": 641,
                        "sub": []
                    },
                    {
                        "name": "印刷操作",
                        "code": 642,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 643,
                        "sub": []
                    }
                ]
            },
            {
                "name": "艺术/设计",
                "code": 644,
                "sub": [
                    {
                        "name": "设计管理人员",
                        "code": 645,
                        "sub": []
                    },
                    {
                        "name": "艺术/设计总监",
                        "code": 646,
                        "sub": []
                    },
                    {
                        "name": "绘画",
                        "code": 647,
                        "sub": []
                    },
                    {
                        "name": "原画师",
                        "code": 648,
                        "sub": []
                    },
                    {
                        "name": "CAD设计/制图",
                        "code": 649,
                        "sub": []
                    },
                    {
                        "name": "平面设计",
                        "code": 650,
                        "sub": []
                    },
                    {
                        "name": "三维/3D设计/制作",
                        "code": 651,
                        "sub": []
                    },
                    {
                        "name": "Flash设计/开发",
                        "code": 652,
                        "sub": []
                    },
                    {
                        "name": "特效设计",
                        "code": 653,
                        "sub": []
                    },
                    {
                        "name": "视觉设计",
                        "code": 654,
                        "sub": []
                    },
                    {
                        "name": "用户体验（UE/UX）设计",
                        "code": 655,
                        "sub": []
                    },
                    {
                        "name": "美术编辑/美术设计",
                        "code": 656,
                        "sub": []
                    },
                    {
                        "name": "多媒体/动画设计",
                        "code": 657,
                        "sub": []
                    },
                    {
                        "name": "包装设计",
                        "code": 658,
                        "sub": []
                    },
                    {
                        "name": "家具设计",
                        "code": 659,
                        "sub": []
                    },
                    {
                        "name": "家居用品设计",
                        "code": 660,
                        "sub": []
                    },
                    {
                        "name": "工艺品/珠宝设计",
                        "code": 661,
                        "sub": []
                    },
                    {
                        "name": "玩具设计",
                        "code": 662,
                        "sub": []
                    },
                    {
                        "name": "店面/展览/展示/陈列设计",
                        "code": 663,
                        "sub": []
                    },
                    {
                        "name": "工业设计",
                        "code": 664,
                        "sub": []
                    },
                    {
                        "name": "游戏界面设计",
                        "code": 665,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 666,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "咨询|法律|教育|翻译",
        "code": 667,
        "sub": [
            {
                "name": "咨询/顾问/调研/数据分析",
                "code": 668,
                "sub": [
                    {
                        "name": "咨询总监",
                        "code": 669,
                        "sub": []
                    },
                    {
                        "name": "咨询经理/主管",
                        "code": 670,
                        "sub": []
                    },
                    {
                        "name": "咨询顾问/咨询员",
                        "code": 671,
                        "sub": []
                    },
                    {
                        "name": "专业顾问",
                        "code": 672,
                        "sub": []
                    },
                    {
                        "name": "调研员",
                        "code": 673,
                        "sub": []
                    },
                    {
                        "name": "数据分析师",
                        "code": 674,
                        "sub": []
                    },
                    {
                        "name": "情报信息分析",
                        "code": 675,
                        "sub": []
                    },
                    {
                        "name": "猎头顾问/助理",
                        "code": 676,
                        "sub": []
                    },
                    {
                        "name": "咨询项目管理",
                        "code": 677,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 678,
                        "sub": []
                    }
                ]
            },
            {
                "name": "教育/培训",
                "code": 679,
                "sub": [
                    {
                        "name": "幼教",
                        "code": 680,
                        "sub": []
                    },
                    {
                        "name": "小学教师",
                        "code": 681,
                        "sub": []
                    },
                    {
                        "name": "初中教师",
                        "code": 682,
                        "sub": []
                    },
                    {
                        "name": "高中教师",
                        "code": 683,
                        "sub": []
                    },
                    {
                        "name": "大学教师",
                        "code": 684,
                        "sub": []
                    },
                    {
                        "name": "职业技术教师",
                        "code": 685,
                        "sub": []
                    },
                    {
                        "name": "家教",
                        "code": 686,
                        "sub": []
                    },
                    {
                        "name": "兼职教师",
                        "code": 687,
                        "sub": []
                    },
                    {
                        "name": "理科教师",
                        "code": 688,
                        "sub": []
                    },
                    {
                        "name": "文科教师",
                        "code": 689,
                        "sub": []
                    },
                    {
                        "name": "外语教师",
                        "code": 690,
                        "sub": []
                    },
                    {
                        "name": "音乐教师",
                        "code": 691,
                        "sub": []
                    },
                    {
                        "name": "美术教师",
                        "code": 692,
                        "sub": []
                    },
                    {
                        "name": "体育老师/教练",
                        "code": 693,
                        "sub": []
                    },
                    {
                        "name": "校长/副校长",
                        "code": 694,
                        "sub": []
                    },
                    {
                        "name": "教学/教务管理人员",
                        "code": 695,
                        "sub": []
                    },
                    {
                        "name": "培训督导",
                        "code": 696,
                        "sub": []
                    },
                    {
                        "name": "培训师/讲师",
                        "code": 697,
                        "sub": []
                    },
                    {
                        "name": "培训助理/助教",
                        "code": 698,
                        "sub": []
                    },
                    {
                        "name": "教育产品开发",
                        "code": 699,
                        "sub": []
                    },
                    {
                        "name": "培训策划",
                        "code": 700,
                        "sub": []
                    },
                    {
                        "name": "培训/招生/课程顾问",
                        "code": 701,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 702,
                        "sub": []
                    }
                ]
            },
            {
                "name": "律师/法务/合规",
                "code": 703,
                "sub": [
                    {
                        "name": "法务经理/主管",
                        "code": 704,
                        "sub": []
                    },
                    {
                        "name": "法务专员/助理",
                        "code": 705,
                        "sub": []
                    },
                    {
                        "name": "律师",
                        "code": 706,
                        "sub": []
                    },
                    {
                        "name": "律师助理",
                        "code": 707,
                        "sub": []
                    },
                    {
                        "name": "企业律师/合规经理/主管",
                        "code": 708,
                        "sub": []
                    },
                    {
                        "name": "企业律师/合规顾问",
                        "code": 709,
                        "sub": []
                    },
                    {
                        "name": "知识产权/专利顾问/代理人",
                        "code": 710,
                        "sub": []
                    },
                    {
                        "name": "合同管理",
                        "code": 711,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 712,
                        "sub": []
                    }
                ]
            },
            {
                "name": "翻译（口译与笔译）",
                "code": 713,
                "sub": [
                    {
                        "name": "英语翻译",
                        "code": 714,
                        "sub": []
                    },
                    {
                        "name": "法语翻译",
                        "code": 715,
                        "sub": []
                    },
                    {
                        "name": "日语翻译",
                        "code": 716,
                        "sub": []
                    },
                    {
                        "name": "德语翻译",
                        "code": 717,
                        "sub": []
                    },
                    {
                        "name": "俄语翻译",
                        "code": 718,
                        "sub": []
                    },
                    {
                        "name": "西班牙语翻译",
                        "code": 719,
                        "sub": []
                    },
                    {
                        "name": "意大利语翻译",
                        "code": 720,
                        "sub": []
                    },
                    {
                        "name": "葡萄牙语翻译",
                        "code": 721,
                        "sub": []
                    },
                    {
                        "name": "阿拉伯语翻译",
                        "code": 722,
                        "sub": []
                    },
                    {
                        "name": "韩语/朝鲜语翻译",
                        "code": 723,
                        "sub": []
                    },
                    {
                        "name": "其他语种翻译",
                        "code": 724,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "服务业",
        "code": 725,
        "sub": [
            {
                "name": "商超/酒店/娱乐管理/服务",
                "code": 726,
                "sub": [
                    {
                        "name": "店长/卖场管理",
                        "code": 727,
                        "sub": []
                    },
                    {
                        "name": "楼面管理",
                        "code": 728,
                        "sub": []
                    },
                    {
                        "name": "品牌/连锁招商管理",
                        "code": 729,
                        "sub": []
                    },
                    {
                        "name": "大堂经理/领班",
                        "code": 730,
                        "sub": []
                    },
                    {
                        "name": "酒店管理",
                        "code": 731,
                        "sub": []
                    },
                    {
                        "name": "客房管理",
                        "code": 732,
                        "sub": []
                    },
                    {
                        "name": "收银主管",
                        "code": 733,
                        "sub": []
                    },
                    {
                        "name": "收银员",
                        "code": 734,
                        "sub": []
                    },
                    {
                        "name": "店员/营业员/导购员",
                        "code": 735,
                        "sub": []
                    },
                    {
                        "name": "理货员",
                        "code": 736,
                        "sub": []
                    },
                    {
                        "name": "促销主管/督导",
                        "code": 737,
                        "sub": []
                    },
                    {
                        "name": "促销员",
                        "code": 738,
                        "sub": []
                    },
                    {
                        "name": "品类管理",
                        "code": 739,
                        "sub": []
                    },
                    {
                        "name": "前厅接待/礼仪/迎宾",
                        "code": 740,
                        "sub": []
                    },
                    {
                        "name": "预订员",
                        "code": 741,
                        "sub": []
                    },
                    {
                        "name": "行李员",
                        "code": 742,
                        "sub": []
                    },
                    {
                        "name": "服务员",
                        "code": 743,
                        "sub": []
                    },
                    {
                        "name": "防损员/内保",
                        "code": 744,
                        "sub": []
                    },
                    {
                        "name": "奢侈品销售",
                        "code": 745,
                        "sub": []
                    },
                    {
                        "name": "主持人/司仪",
                        "code": 746,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 747,
                        "sub": []
                    }
                ]
            },
            {
                "name": "旅游/度假/出入境服务",
                "code": 748,
                "sub": [
                    {
                        "name": "旅游产品销售",
                        "code": 749,
                        "sub": []
                    },
                    {
                        "name": "旅游顾问",
                        "code": 750,
                        "sub": []
                    },
                    {
                        "name": "导游/票务",
                        "code": 751,
                        "sub": []
                    },
                    {
                        "name": "旅游计划调度",
                        "code": 752,
                        "sub": []
                    },
                    {
                        "name": "旅游产品/线路策划",
                        "code": 753,
                        "sub": []
                    },
                    {
                        "name": "签证业务办理",
                        "code": 754,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 755,
                        "sub": []
                    }
                ]
            },
            {
                "name": "烹饪/料理/食品研发",
                "code": 756,
                "sub": [
                    {
                        "name": "厨师/面点师",
                        "code": 757,
                        "sub": []
                    },
                    {
                        "name": "食品加工/处理",
                        "code": 758,
                        "sub": []
                    },
                    {
                        "name": "调酒师/茶艺师/咖啡师",
                        "code": 759,
                        "sub": []
                    },
                    {
                        "name": "营养师",
                        "code": 760,
                        "sub": []
                    },
                    {
                        "name": "厨工",
                        "code": 761,
                        "sub": []
                    },
                    {
                        "name": "食品/饮料研发",
                        "code": 762,
                        "sub": []
                    },
                    {
                        "name": "食品/饮料检验",
                        "code": 763,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 764,
                        "sub": []
                    }
                ]
            },
            {
                "name": "保健/美容/美发/健身",
                "code": 765,
                "sub": [
                    {
                        "name": "美发/发型师",
                        "code": 766,
                        "sub": []
                    },
                    {
                        "name": "化妆师",
                        "code": 767,
                        "sub": []
                    },
                    {
                        "name": "美容师/美甲师",
                        "code": 768,
                        "sub": []
                    },
                    {
                        "name": "美容顾问(BA)",
                        "code": 769,
                        "sub": []
                    },
                    {
                        "name": "健身/美体/舞蹈教练",
                        "code": 770,
                        "sub": []
                    },
                    {
                        "name": "按摩/足疗",
                        "code": 771,
                        "sub": []
                    },
                    {
                        "name": "救生员",
                        "code": 772,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 773,
                        "sub": []
                    }
                ]
            },
            {
                "name": "医院/医疗/护理",
                "code": 774,
                "sub": [
                    {
                        "name": "医疗管理人员",
                        "code": 775,
                        "sub": []
                    },
                    {
                        "name": "综合门诊/全科医生",
                        "code": 776,
                        "sub": []
                    },
                    {
                        "name": "内科医生",
                        "code": 777,
                        "sub": []
                    },
                    {
                        "name": "外科医生",
                        "code": 778,
                        "sub": []
                    },
                    {
                        "name": "儿科医生",
                        "code": 779,
                        "sub": []
                    },
                    {
                        "name": "牙科医生",
                        "code": 780,
                        "sub": []
                    },
                    {
                        "name": "美容整形科医生",
                        "code": 781,
                        "sub": []
                    },
                    {
                        "name": "中医科医生",
                        "code": 782,
                        "sub": []
                    },
                    {
                        "name": "麻醉医生",
                        "code": 783,
                        "sub": []
                    },
                    {
                        "name": "心理医生",
                        "code": 784,
                        "sub": []
                    },
                    {
                        "name": "眼科医生/验光师",
                        "code": 785,
                        "sub": []
                    },
                    {
                        "name": "医学影像/放射科医师",
                        "code": 786,
                        "sub": []
                    },
                    {
                        "name": "化验/检验科医师",
                        "code": 787,
                        "sub": []
                    },
                    {
                        "name": "药房管理/药剂师",
                        "code": 788,
                        "sub": []
                    },
                    {
                        "name": "理疗师",
                        "code": 789,
                        "sub": []
                    },
                    {
                        "name": "兽医",
                        "code": 790,
                        "sub": []
                    },
                    {
                        "name": "护士/护理人员",
                        "code": 791,
                        "sub": []
                    },
                    {
                        "name": "营养师",
                        "code": 792,
                        "sub": []
                    },
                    {
                        "name": "针灸/推拿",
                        "code": 793,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 794,
                        "sub": []
                    }
                ]
            },
            {
                "name": "社区/居民/家政服务",
                "code": 795,
                "sub": [
                    {
                        "name": "保安经理",
                        "code": 796,
                        "sub": []
                    },
                    {
                        "name": "保安",
                        "code": 797,
                        "sub": []
                    },
                    {
                        "name": "家政人员",
                        "code": 798,
                        "sub": []
                    },
                    {
                        "name": "婚礼/庆典策划服务",
                        "code": 799,
                        "sub": []
                    },
                    {
                        "name": "宠物护理和美容",
                        "code": 800,
                        "sub": []
                    },
                    {
                        "name": "保姆/母婴护理",
                        "code": 801,
                        "sub": []
                    },
                    {
                        "name": "搬运工",
                        "code": 802,
                        "sub": []
                    },
                    {
                        "name": "保洁",
                        "code": 803,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 804,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "能源|环保|农业|科研",
        "code": 805,
        "sub": [
            {
                "name": "能源/矿产/地质勘查",
                "code": 806,
                "sub": [
                    {
                        "name": "石油/天然气技术人员",
                        "code": 807,
                        "sub": []
                    },
                    {
                        "name": "空调/热能工程师",
                        "code": 808,
                        "sub": []
                    },
                    {
                        "name": "核力/火力工程师",
                        "code": 809,
                        "sub": []
                    },
                    {
                        "name": "水利/水电工程师",
                        "code": 810,
                        "sub": []
                    },
                    {
                        "name": "电力工程师/技术员",
                        "code": 811,
                        "sub": []
                    },
                    {
                        "name": "地质勘查/选矿/采矿",
                        "code": 812,
                        "sub": []
                    },
                    {
                        "name": "能源/矿产项目管理",
                        "code": 813,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 814,
                        "sub": []
                    }
                ]
            },
            {
                "name": "环境科学/环保",
                "code": 815,
                "sub": [
                    {
                        "name": "环保技术工程师",
                        "code": 816,
                        "sub": []
                    },
                    {
                        "name": "环境评价工程师",
                        "code": 817,
                        "sub": []
                    },
                    {
                        "name": "环境监测工程师",
                        "code": 818,
                        "sub": []
                    },
                    {
                        "name": "水处理工程师",
                        "code": 819,
                        "sub": []
                    },
                    {
                        "name": "固废处理工程师",
                        "code": 820,
                        "sub": []
                    },
                    {
                        "name": "废气处理工程师",
                        "code": 821,
                        "sub": []
                    },
                    {
                        "name": "生态治理/规划",
                        "code": 822,
                        "sub": []
                    },
                    {
                        "name": "环境管理/园林景区保护",
                        "code": 823,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 824,
                        "sub": []
                    }
                ]
            },
            {
                "name": "农/林/牧/渔业",
                "code": 825,
                "sub": [
                    {
                        "name": "农艺师",
                        "code": 826,
                        "sub": []
                    },
                    {
                        "name": "林业技术人员",
                        "code": 827,
                        "sub": []
                    },
                    {
                        "name": "园艺师",
                        "code": 828,
                        "sub": []
                    },
                    {
                        "name": "畜牧师",
                        "code": 829,
                        "sub": []
                    },
                    {
                        "name": "动物育种/养殖",
                        "code": 830,
                        "sub": []
                    },
                    {
                        "name": "动物营养/饲料研发",
                        "code": 831,
                        "sub": []
                    },
                    {
                        "name": "饲料销售",
                        "code": 832,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 833,
                        "sub": []
                    }
                ]
            },
            {
                "name": "公务员/事业单位/科研机构",
                "code": 834,
                "sub": [
                    {
                        "name": "公务员/事业单位人员",
                        "code": 835,
                        "sub": []
                    },
                    {
                        "name": "科研管理人员",
                        "code": 836,
                        "sub": []
                    },
                    {
                        "name": "科研人员",
                        "code": 837,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 838,
                        "sub": []
                    }
                ]
            }
        ]
    },
    {
        "name": "兼职|实习|社工|其他",
        "code": 839,
        "sub": [
            {
                "name": "实习生/培训生/储备干部",
                "code": 840,
                "sub": [
                    {
                        "name": "实习生",
                        "code": 841,
                        "sub": []
                    },
                    {
                        "name": "培训生",
                        "code": 842,
                        "sub": []
                    },
                    {
                        "name": "储备干部",
                        "code": 843,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 844,
                        "sub": []
                    }
                ]
            },
            {
                "name": "志愿者/社会工作者",
                "code": 845,
                "sub": [
                    {
                        "name": "志愿者/义工",
                        "code": 846,
                        "sub": []
                    },
                    {
                        "name": "社会工作者/社工",
                        "code": 847,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 848,
                        "sub": []
                    }
                ]
            },
            {
                "name": "兼职/临时",
                "code": 849,
                "sub": [
                    {
                        "name": "兼职",
                        "code": 850,
                        "sub": []
                    },
                    {
                        "name": "临时",
                        "code": 851,
                        "sub": []
                    },
                    {
                        "name": "其他",
                        "code": 852,
                        "sub": []
                    }
                ]
            }
        ]
    }
];
function init(that){
    that.setData( {
        'industryData': industryData
    });
}

module.exports={
    init:init
}