var positionData = [
    {
        "name": "IT|通信|电子|互联网",
        "code": 1001,
        "sub": [
            {
                "name": "互联网/电子商务",
                "code": 2001,
                "sub": []
            },
            {
                "name": "计算机软件",
                "code": 2002,
                "sub": []
            },
            {
                "name": "IT服务(系统/数据/维护)",
                "code": 2003,
                "sub": []
            },
            {
                "name": "电子技术/半导体/集成电路",
                "code": 2004,
                "sub": []
            },
            {
                "name": "计算机硬件",
                "code": 2005,
                "sub": []
            },
            {
                "name": "通信/电信/网络设备",
                "code": 2006,
                "sub": []
            },
            {
                "name": "通信/电信运营、增值服务",
                "code": 2007,
                "sub": []
            },
            {
                "name": "网络游戏",
                "code": 2008,
                "sub": []
            }
        ]
    },
    {
        "name": "金融业",
        "code": 1002,
        "sub": [
            {
                "name": "基金/证券/期货/投资",
                "code": 2009,
                "sub": []
            },
            {
                "name": "保险",
                "code": 2010,
                "sub": []
            },
            {
                "name": "银行",
                "code": 2011,
                "sub": []
            },
            {
                "name": "信托/担保/拍卖/典当",
                "code": 2012,
                "sub": []
            }
        ]
    },
    {
        "name": "房地产|建筑业",
        "code": 1003,
        "sub": [
            {
                "name": "房地产/建筑/建材/工程",
                "code": 2013,
                "sub": []
            },
            {
                "name": "家居/室内设计/装饰装潢",
                "code": 2014,
                "sub": []
            },
            {
                "name": "物业管理/商业中心",
                "code": 2015,
                "sub": []
            }
        ]
    },
    {
        "name": "商业服务",
        "code": 1004,
        "sub": [
            {
                "name": "专业服务/咨询(财会/法律/人力资源等)",
                "code": 2017,
                "sub": []
            },
            {
                "name": "广告/会展/公关",
                "code": 2018,
                "sub": []
            },
            {
                "name": "中介服务",
                "code": 2019,
                "sub": []
            },
            {
                "name": "检验/检测/认证",
                "code": 2020,
                "sub": []
            },
            {
                "name": "外包服务",
                "code": 2021,
                "sub": []
            }
        ]
    },
    {
        "name": "贸易|批发|零售|租赁业",
        "code": 1005,
        "sub": [
            {
                "name": "快速消费品（食品/饮料/烟酒/日化）",
                "code": 2023,
                "sub": []
            },
            {
                "name": "耐用消费品（服饰/纺织/皮革/家具/家电）",
                "code": 2024,
                "sub": []
            },
            {
                "name": "贸易/进出口",
                "code": 2025,
                "sub": []
            },
            {
                "name": "零售/批发",
                "code": 2026,
                "sub": []
            },
            {
                "name": "租赁服务",
                "code": 2027,
                "sub": []
            }
        ]
    },
    {
        "name": "文体教育|工艺美术",
        "code": 1006,
        "sub": [
            {
                "name": "教育/培训/院校",
                "code": 2029,
                "sub": []
            },
            {
                "name": "礼品/玩具/工艺美术/收藏品/奢侈品",
                "code": 2030,
                "sub": []
            }
        ]
    },
    {
        "name": "生产|加工|制造",
        "code": 1007,
        "sub": [
            {
                "name": "汽车/摩托车",
                "code": 2031,
                "sub": []
            },
            {
                "name": "大型设备/机电设备/重工业",
                "code": 2032,
                "sub": []
            },
            {
                "name": "加工制造（原料加工/模具）",
                "code": 2033,
                "sub": []
            },
            {
                "name": "仪器仪表及工业自动化",
                "code": 2034,
                "sub": []
            },
            {
                "name": "印刷/包装/造纸",
                "code": 2035,
                "sub": []
            },
            {
                "name": "办公用品及设备",
                "code": 2036,
                "sub": []
            },
            {
                "name": "医药/生物工程",
                "code": 2037,
                "sub": []
            },
            {
                "name": "医疗设备/器械",
                "code": 2038,
                "sub": []
            },
            {
                "name": "航空/航天研究与制造",
                "code": 2039,
                "sub": []
            }
        ]
    },
    {
        "name": "交通|运输|物流|仓储",
        "code": 1008,
        "sub": [
            {
                "name": "交通/运输",
                "code": 2041,
                "sub": []
            },
            {
                "name": "物流/仓储",
                "code": 2042,
                "sub": []
            }
        ]
    },
    {
        "name": "服务业",
        "code": 1009,
        "sub": [
            {
                "name": "医疗/护理/美容/保健/卫生服务",
                "code": 2043,
                "sub": []
            },
            {
                "name": "酒店/餐饮",
                "code": 2044,
                "sub": []
            },
            {
                "name": "旅游/度假",
                "code": 2045,
                "sub": []
            }
        ]
    },
    {
        "name": "文化|传媒|娱乐|体育",
        "code": 1010,
        "sub": [
            {
                "name": "媒体/出版/影视/文化传播",
                "code": 2047,
                "sub": []
            },
            {
                "name": "娱乐/体育/休闲",
                "code": 2048,
                "sub": []
            }
        ]
    },
    {
        "name": "能源|矿产|环保",
        "code": 1011,
        "sub": [
            {
                "name": "能源/矿产/采掘/冶炼",
                "code": 2049,
                "sub": []
            },
            {
                "name": "石油/石化/化工",
                "code": 2050,
                "sub": []
            },
            {
                "name": "电气/电力/水利",
                "code": 2051,
                "sub": []
            },
            {
                "name": "环保",
                "code": 2052,
                "sub": []
            }
        ]
    },
    {
        "name": "政府|非盈利机构",
        "code": 1012,
        "sub": [
            {
                "name": "政府/公共事业/非盈利机构",
                "code": 2053,
                "sub": []
            },
            {
                "name": "学术/科研",
                "code": 2054,
                "sub": []
            }
        ]
    },
    {
        "name": "农|林|牧|渔|其他",
        "code": 1013,
        "sub": [
            {
                "name": "农/林/牧/渔",
                "code": 2055,
                "sub": []
            },
            {
                "name": "跨领域经营",
                "code": 2056,
                "sub": []
            },
            {
                "name": "其他",
                "code": 2057,
                "sub": []
            }
        ]
    }
];
function init(that) {
    that.setData({
        'positionData': positionData
    });
}

module.exports = {
    init: init
}